import DataModel from '../modules/models/DataModel';

const data: DataModel[] = [
  {
    id: '1',
    title: 'Ваше название',
    items: [
      {
        id: '101',
        name: 'Кинопоиск',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: ['Фильмы', 'Актеры', 'Сценаристы', 'Сериалы'],
        data: {
          'Связанные классы': 190,
          'Связанные объекты': 1338,
          Атрибуты: 312,
        },
      },
      {
        id: '102',
        name: 'Википедия',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: ['Статьи'],
        data: {
          'Связанные классы': 678,
          'Связанные объекты': 2378,
          Атрибуты: 312,
        },
      },
      {
        id: '26',
        name: 'Название объекта',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: [
          'Мстители',
          '2012',
          'фантастика',
          'Мэтт Дэймон',
          'Бен Аффлек',
          'Стеллан Скарсгард',
        ],
        data: {
          Атрибуты: 542,
          'Связанные объекты': 12,
        },
      },
    ],
  },
  {
    id: '2',
    title: 'Совсем другое название',
    items: [
      {
        id: '101',
        name: 'Кино',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: ['Фильмы', 'Актеры', 'Сценаристы', 'Сериалы'],
        data: {
          'Связанные классы': 190,
          'Связанные объекты': 1338,
          Атрибуты: 312,
        },
      },
      {
        id: '102',
        name: 'Википедия',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: ['Статьи'],
        data: {
          'Связанные классы': 678,
          'Связанные объекты': 2378,
          Атрибуты: 312,
        },
      },
      {
        id: '26',
        name: 'Название объекта',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: [
          'Мстители',
          '2012',
          'фантастика',
          'Мэтт Дэймон',
          'Бен Аффлек',
          'Стеллан Скарсгард',
        ],
        data: {
          Атрибуты: 542,
          'Связанные объекты': 12,
        },
      },
    ],
  },
  {
    id: '3',
    title: 'Другое название',
    items: [
      {
        id: '101',
        name: 'Киноискатель',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: ['Фильмы', 'Актеры', 'Сценаристы', 'Сериалы'],
        data: {
          'Связанные классы': 190,
          'Связанные объsadfasdfsd  asdf asd sdaf asdf asекты': 1338,
          Атрибуты: 312,
          Атрываибуты: 312,
          Атрпавываибуты: 312,
          Атриывабуты: 312,
          Атриывбуты: 312,
          Атриымчсвабуты: 312,
          Атриыфвабуты: 312,
        },
      },
      {
        id: '102',
        name: 'Википедия',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: ['Статьи'],
        data: {
          'Связанные классы': 678,
          'Связанные объекты': 2378,
          Атрибуты: 312,
        },
      },
      {
        id: '26',
        name: 'Название объекта',
        createDate: new Date(2022, 1, 17),
        updateDate: new Date(2022, 1, 17),
        keywords: [
          'Мстители',
          '2012',
          'фантастика',
          'Мэтт Дэймон',
          'Бен Аффлек',
          'Стеллан Скарсгард',
        ],
        data: {
          Атрибуты: 542,
          'Связанные объекты': 12,
        },
      },
    ],
  },
];
export default data;
